---
title: DuctInsulation
classe: Autodesk.Revit.DB.Mechanical.DuctInsulation
namespace: Autodesk.Revit.DB.Mechanical
eredita: Autodesk.Revit.DB.InsulationLiningBase
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 1
---

# DuctInsulation

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `DuctInsulation Create(Document, ElementId, ElementId, Double)` | `DuctInsulation.Create(document, ductOrContentElementId, ductInsulationTypeId, Thickness)` | DuctInsulation |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```